{"pages":[{"title":"404 Not Found","text":"Oops!您访问的页面走丢了。回到主页","link":"/404.html"},{"title":"about","text":"欢迎来到 Hyiontek.com!这里是Jerry Gao de 个人博客！ 公告这是本人的个人站点，用于发表一些自己的心情、体会、经验、见闻，欢迎访问！对于文章中的疑问、建议、意见、看法可进行评论。请文明评论，不喜勿喷，谢谢！😉 关于我Jerry Gao是本博客的站长和维护者，喜欢音乐🎵、计算机💻、阅读📖……现在就读高中。 关于网址网址”hyiontek.com”来源于”hydrion”和”tech”两个英文单词的变形组合。含有极简和科技之意。 关于logoLogo是本人设计的，灵感来源于氢阳离子。因其仅有一个单独存在质子，寓意极简。Logo主体为一个蓝色带缺口的圆圈，中央是一个变形的字母”H”，右上角有一个加号。图案右侧是深蓝色的”tek”。图案包含字母”H””y””o”.","link":"/about/index.html"}],"posts":[{"title":"《哪吒之魔童降世》观后感","text":"这部电影是国漫在技术和价值上的突破 影片在原著的基础上进行了再创作，电影中的哪吒颠覆了人们的认知，因被申公豹掉包，不幸成为魔丸转世。他生性顽劣，只有用乾坤圈才能镇住其魔性。他虽内心也有善良的一面，但始终被陈塘关村民惧怕、唾弃。人们的成见和哪吒自身难以控制的巨大力量让他和村民的关系日趋恶化。这使我们不由思考，我们是否也如村民一样，对易己着抱着成见，在不经意问给他们带来巨大的痛苦？影片中，哪吒和村民、龙族和天界、申公豹和元始天尊之间的种种矛盾都源于他们之间的成见。而在现实生活中，是否很多矛盾也同样如此呢？假若我们能抛下成见，以公平的眼光看待每一个人，大概很多冲突都能化解吧！ 影片后半部分，哪吒三岁生辰那天因元始天尊给魔丸下的天雷咒，遭到了命中定的天雷的打击。这时，情节反转，灵珠转世的龙族敖丙前来帮助，只因哪吒是他唯一的朋友。在这个充满成见和不公的世界中，孤独的他们因最纯真的友谊而相互联系，一起挑战所谓的天命。最终，在太乙真人的协助下，他们打破了本是无解的天雷咒，保住了灵魂。这大概象征着，真正的友谊和敢于挑战的精神是一生中最宝贵的财富，只要不失去，就不会失去内心深处的自我。哪吒生命中，命运坎坷，遭遇了种种不公，但他凭借自己的顽强，笑到了最后。他能在面对死亡时，平静地说出“我自己的命我自己扛，不连累别人”；能在连敖丙都不看好他时喊出“我命由我不由天，是魔是仙，我是谁只有我自己说了算”；能对敖丙说出“若命运不公，就和它斗到底”……他就是自己的英雄。 “如果你问我，人能否改变自己的命运，我也不晓得，但是不认命，就是哪吒的命。” (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-06/Nezha/"},{"title":"晓世家望族的兴衰荣辱——读《红楼梦有感》","text":"小学时就曾读过《红楼梦》，那时却不觉其中滋味，竟无甚印象。如今再读，终于略有所悟。《红楼梦》，所谓的石头记，实则是曹雪芹一生盛极而衰生活的真实写照，在当今仍颇有意味。 满纸荒唐言，一把辛酸泪。都云作者痴，谁解其中味！ 故事从空空道人的《好了歌》说起，寥寥数语道尽全书主旨——不管怎样盛极一时，到头来都如一场空梦。诸如王熙凤之类的人，一生要强好胜，“机关算尽太聪明”，到最后“反算了卿卿性命”。全书以贾家为主线，中间穿插甄家命运，似闲笔，但却是“假作真时真亦假，无为有处有还无”，在真假虚实间暗透贾家命运，暗示背后的心酸。 《红楼梦》不同于其他小说，在第五回的判词中就已透露全书结局。然初读又有谁能读懂？只有在阅读中慢慢领悟。书中众小姐丫头，个个性格鲜明、令人怜惜。宝钗之处世周到，黛玉之才思敏捷，湘云之天真可爱，探春之精明能干；又有温和体贴之袭人、刚烈直率之晴雯、善良聪慧之平儿、自尊刚强之鸳鸯……实为难得。 红楼前五十回，结诗社、庆佳节、猜灯谜、游大观园，情节较为清新明快，令人读之不由心中喜悦。我最喜书中湘云。她性格直爽，常着男装，大大咧咧，十分活泼可爱。她在大观园中烤鹿肉、行酒令、醉眠芍药裀，大观园中时常回响着她的欢声笑语。她身世坎坷，但不似黛玉之悲戚，显露出一种令人惊叹的乐观。然而这样的可人，“终是云散高唐，水涸湘江”。六十回开始，情势急转直下，越读下去，越觉心情低落。感叹曹公妙笔之余，又不免哀叹书中活泼鲜明的一个个少女形象红颜命薄，感悟世事无常。 而观书中婆子媳妇丑恶嘴脸，更觉遗憾。《红楼梦》中，少女形象往往温和可爱，而婆子总被塑造成势力琐碎之人。令人不由发觉人世间的残酷，年少时的美好单纯，往往会因生活而扭曲、丢失。到后来，贾府渐渐衰败，这种境况更是恶化。利益面前，人们已失去了欣赏生活之美的心境，只知勾心斗角、争夺利益。 这些只是我浅读的见解。《红楼梦》是一部不可多得的人生教科书，每读一遍，都会随阅历和境遇不同而生发出不同见解。愿每个人都能细读之、品味之，从中吸取教训，洞察人生百态，保留自己心底的一份纯真。 趁着这奈何天，伤怀日，寂寥时，试遣愚衷。 (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-16/The-Dream-of-Red-Mansion/"},{"title":"Hexo+GitHubPages 建站教程（2019详细）","text":"费劲一番周折😂，终于成功地建成了一个自己的博客。在此，就把我自己建站的经验写成教程，以供参考。 建站方法优劣：&emsp;&emsp;优：耗资少；简单，适合初学者；网上教程多；有大量国内开发者。 &emsp;&emsp;劣：博文多了之后生成速度变慢 &emsp;&emsp;本机环境：Windows 10 x64 专业版 准备条件：&emsp;&emsp;安装node.js &emsp;&emsp;安装Git &emsp;&emsp;安装Visual Studio Code &emsp;&emsp;以管理员身份运行cmd (adsbygoogle = window.adsbygoogle || []).push({}); 进入正题由于直接使用npm install指令在国内下载速度有时较慢，所以可以安装cnpm来替代npm： 1npm install -g cnpm --registry=https://registry.npm.taobao.org 安装hexo1cnpm install hexo-cli -g 生成博客文件123hexo init file #init后的file用文件目录替代cd filecnpm install 安装插件12cnpm install hexo-server --save #生成本地服务器所需插件cnpm install hexo-deployer-git --save #使用git方式进行部署博客所需插件 现在，一个博客的雏形就完成了。 创建GitHub仓库打开GitHub并注册/登录。 然后点击右上角“+”号创建仓库 名称可以随便取，也可以用“自己的账户名称.GitHub.io”的形式，后者以后可直接访问https://账户名称.GitHub.io/打开博客。随后点击Create repository。 在随后出现的页面中复制HTTPS地址， 打开刚才生成博客的文件目录，找到名为_config.yml的文件，翻到底部，添加代码 1234deploy: type: git repository: https://github.com/JerryGaoY/hyiontek.git #填写刚才复制的内容 branch: master 修改主题打开Hexo主题，自选主题。以我的博客为例，我用的是Icarus主题。回到cmd，在博客文件目录下输入代码： 1git clone https://github.com/ppoffice/hexo-theme-icarus.git themes/icarus 接下来，请将博客根目录下的_config.yml中的主题设置改为icarus： 1theme: icarus #记得&quot;:&quot;后加空格 （另外，由于Icarus主题发布者没有在GitHub 仓库 master branch中发布主题配置文件_config.yml，所以我到他的site branch中下载了_config.theme.yml文件，修改文件名复制到themes/Icarus目录，其他主题一般不会遇到这种问题，不多赘述） 然后，根据主题发布者提供的教程，修改themes目录下的_config.yml。 修改完成，再回到cmd输入 12hexo ghexo s 如果不出错，这时候可以在http://localhost:4000/查看效果，查看完，回到cmd，按Ctrl+C退出。 撰写博文在cmd中输入 1hexo new 模板 文章文件名 模板 处有三种类型，如下|参数|功能|路径||:-|:-|:-||post|新建文章|/source/_posts/||draft|新建草稿|/source/_drafts/||page|新建页面（标签页，分类页等）|/source/|找到生成的.md文件，用Visual Studio Code打开，进行编辑。编辑器遵守Markdown语法。单机右上角图标进行预览 上传前的准备如果想绑定自己注册的域名，就打开博客文件根目录中的source文件夹，新建.txt文件，修改文件名为CNAME（不要后缀名，大写），用记事本打开，输入域名，以本人的为例：hyiontek.com 保存。 上传到GitHub仓库在cmd中输入 1hexo d 在弹窗中登录GitHub账户即可 域名解析打开CloudFlare,注册，按照提示绑定域名，如图进行配置 按照提示到域名注册商处修改dns服务器为cloudflare提供的服务器，完成配置。 (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-03/Blog-making guide/"},{"title":"华为鸿蒙，填补中国自研多平台操作系统空白","text":"有志者、事竟成，破釜沉舟，百二秦关终属楚苦心人、天不负，卧薪尝胆，三千越甲可吞吴 华为，自1987年白手起家，怀着“中华有为”的梦想，面对技术的困难、资金的短缺、外界的质疑……但他们坚持了下来，成就了当今中国乃至世界最具有创造力和实力的科技公司之一。 麒麟、鲲鹏、朱雀、苍穹……这一个个来自《山海经》的名字，含着华为对于振兴中华的愿景。而今，华为鸿蒙诞生，打破了欧美国家对于中国的封锁，填补了技术的空白。现代汉语词典上，鸿蒙是“宇宙形成前的混沌状态”的意思。华为鸿蒙，正是要打破我国自研多平台操作系统空白，有鸿蒙初辟，开天辟地之意。 鸿蒙系统的发布，昭示着华为已能突破外国的限制，让华为在国际能有更高的话语权和自主权，也给未来做好了充分的准备。从此，华为不用担心再被欧美掐着脖子，它向世界宣告，中国科技的发展，势不可挡。 “士不可以不弘毅，任重而道远。”华为鸿蒙，还有很长的路要走。作为一个新生的操作系统，是否可行还等待时间的考验。我们应正确冷静看待华为鸿蒙，并支持其发展。期待鸿蒙系统的未来，相信华为不会令我们失望。 (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-12/Harmony-OS/"},{"title":"中元节，简谈中国传统节日","text":"今天是中国四大传统祭祖节日之一的中元节，虽然家里没有过中元节的习惯，但我也着实体会到了节日的气息。 在通州，中元节当天，不少人很早就开始了中元节的仪式。从城郊到乡下，人们挪出了铁炉，焚烧纸钱祭祖。且不说对环境的影响，橘红色的火光摇曳，一家人围聚在一起，向前辈许下自己对未来的愿望，着实是一道美丽而温馨的风景。 中元节，俗称鬼节👻，是一个源于道教的传统节日。同时，它又是佛教中的盂兰盆节。这个节日将中国佛教卍和道教☯️两大富于特色的宗教紧密联系在一起，形成中国不同宗教共生的奇特现象，暗含中国求同存异、兼容并蓄的思想。祭祖上坟、放荷灯🕯️🌷、放天灯……种种富于仪式感的习俗，无不饱含着对于先人的缅怀和珍惜互爱的愿望。这个节日的特色之丰富，堪称是中国一大非物质文化遗产。 而我们启海人祭祖，又是另一番风俗。每到过年和清明，总会赶回老家，家人团聚，买上纸钱，叠好金元宝去上坟。我们会依照辈分，向祖辈磕头祈愿，追忆前辈。或祈求工作顺利，或祈求考得好成绩。虽并不相信真的能灵验，但心中还是会获得几份慰藉。愿望虽简单，但让人踏实了不少。过年时，还会放上几箱爆竹🧨，爆竹声响，一地碎红，感觉一年的不快都被赶净。 中国上下五千年的积淀，铸就了中国传统节日文化的多样性。春节🧧🥟、中秋🥮、端午⛰️……种种节日，种种不同的风俗，年复一年地上演着，生生不息，这是特有的中国味道。传统节日，丰富了我们的生活，给一个个平淡的日子赋予了特殊的意义。这些节日，在从前是人们对幸福美好生活的期望，是艰辛的生活中的盼头。而在物质条件丰富的当今，这些节日依然意义非常。它们丰富了人们的精神生活，给忙碌中的人们一个放松的机会，一个感受生活的机会。 当然，在现代，传统节日中还是应该注意环境、文明过节。 (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-15/Zhongyuan-Festival/"},{"title":"Windows下Visual Studio Code入门和配置C++编译环境","text":"写在前面：为什么选择 史上第一IDE Visual Studio Code（以下简称Vscode）? 支持多种语言的； 界面简洁，代码高亮清晰，自动补全功能完善； 插件商店提供多种插件，可满足多种需求； 用户多，支持完善…… 1. 安装Vscode不做赘述，传送门。 2. 设置简体中文启动Vscode，点击右侧第五个图标打开扩展页(Extension)。 搜索”Chinese Simplified”，选择第一个扩展并安装。安装完，重启Vscode。完成设置中文。 (adsbygoogle = window.adsbygoogle || []).push({}); 3. 安装必要插件同上，打开扩展页，搜索Code Runner,C/C++扩展并安装。 4. 安装编译包并配置环境下载 MinGW（或 MinGW-w64 ）安装包。本文以 MinGW 为例。下载链接：MinGWMinGW-w64 安装完成 MinGW 后，启动 MinGW Installation Manager ，如图勾选以下包。（勾选方法：单机复选框并点击 “Mark for installation” ） 然后，点击右侧 All Packages ，如图红线勾选必须项。其余可根据个人需要和下方注释勾选。 最后点击左上方 “Apply Changes” 安装。安装较慢，请耐心等待。（无法安装或过慢可以翻·墙） 安装完成后，到桌面，右击此电脑-属性-高级系统设置-环境变量-系统变量-Path-编辑-新建，然后输入刚才安装的 MinGW 的地址（一般在 C: 盘，如图：C:\\MinGW\\bin） 5. 最后配置重启 Vscode，点击右侧“齿轮”-设置，在设置页中搜索 “run in terminal” ，找到 Code Runner: Run in terminal 项并勾选上复选框，即可完成配置。 6. 效果 参考文章：整理：Visual Studio Code (vscode) 配置C、C++环境/编写运行C、C++（主要Windows、简要Linux）- bat67 - CSDN VSCode设置中文语言显示 - 飞扬_0426 - CSDN (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-18/Vscode-cpp-compile-setting/"},{"title":"致敬中国消防员🚒——观《烈火英雄》有感","text":"你太不了解消防员了！ ——烈火英雄 观看完影片，我不由为中国消防员的勇气和视死如归的气概所打动。水火无情，但中国消防员的力量是不可估量的。🔥火场形势危急，一旦火情失控后果无法设想，就在全市市民都在仓皇逃跑之际，消防员是最美的逆行者。本以为影片情节有夸张的部分，谁知真实事件远比电影震撼。影片以“大连7·16油爆火灾”为原型，以电影中手工关阀门的情节为例，剧情设计成8000转就能关闭，事实上是80000转。而且，当时的三位消防员为了加快速度，确实都摘掉了手套。试想一下，在那样的高温下，别说80000、8000圈，就是80圈，一般人都无法忍受。然而消防员们，心怀着拯救人民生命财产安全的决心，能爆发出难以想象的力量。消防员也是人，他们也有家人，但在他们的心中，人民的安全才是最重要的。即使是即将退伍，他们依然会誓死守卫在火场，与烈火开展一场不能失败的战斗。面对逼人的高温、爆炸的危险、剧毒的化学药剂、来势汹汹的流淌火……他们难道不害怕吗？但他们愿意押上自己的生命，与无情的火灾对抗。 哪有什么岁月静好，只不过是有人在替你负重前行。 表达对于中国消防员的敬意之余，也提醒着我们，要注意用火安全，时刻细心谨慎。如果我们能从自身做起，让火灾消于无形，让消防员不再“有用武之地”，不就能保住这些勇士的生命吗？ (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-10/fire-hero/"},{"title":"三个叔叔手工吐司（通州南山湖店）小记","text":"南山湖三个叔叔手工吐司（下称“三个叔叔”或“吐司店”）开业了！在此，我写一篇小记来记录一下我的体会，也给新店捧捧场。 吐司店坐落于南山湖一号旁，白底黑字的招牌简洁而不失醒目，给人留下深刻印象。店面一侧玻璃门后，几个火烈鸟的装饰格外别致。推门进入，左侧是清新雅致的休息区，右边的玻璃柜内整齐地陈列着做好的吐司🍞，给人以整洁的印象。柜台背后，清晰地列出了吐司🍞和饮品☕的名字和标价。吐司品种繁多——原味🍞、巧克力🍫、奶酥🥛、菠萝🍍……可以提前一天预订自己喜欢的品种。柜台上还摆放着小块的新鲜吐司，可供免费品尝。吐司店的最里面是吐司烘焙坊，烤箱、消毒柜等机器整齐摆放着，十分干净清爽。吐司都是纯手工制作的，一步都不马虎，无数次的揉面、擀面、敲打，都是吐司在成品过程中必经的淬炼。4个小时，才能成就一炉美味的吐司。买了一袋较受欢迎的奶酥吐司，回家细细品尝。吐司入嘴，口感细腻，味道醇香，毫不甜腻。它不同于机器制造的速成品，手工的繁复工序让它的口感和甜度都恰到好处。实为吐司佳品。 (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-09/Three-Uncles-Handmade-Toast/"},{"title":"download","text":"本站下载页面 温馨提示：坚果云下载地址无广告下载内容均来自于网络，如有侵权请在评论区告知 (adsbygoogle = window.adsbygoogle || []).push({}); 谷歌访问助手破解版2.3.0-chrome插件&emsp; 下载地址：https://www.lanzous.com/ia76ztc（蓝奏云） &emsp;&emsp;&emsp;&emsp;&emsp;&emsp; https://www.jianguoyun.com/p/DbWweH0QrJCZCBii9_QC（坚果云） &emsp;&emsp;&emsp;&emsp;&emsp;&emsp; https://pan.baidu.com/s/1kF-Qy4yEjgmofEewDkD3IA 提取码：2956 （百度网盘） Adobe CC 2019-2020 破解工具-密码：”hyiontek.com”&emsp; 下载地址：https://www.lanzous.com/ia77bsd（蓝奏云） &emsp;&emsp;&emsp;&emsp;&emsp;&emsp; https://www.jianguoyun.com/p/DXwV2KsQhO6ZCBjv9_QC（坚果云） &emsp;&emsp;&emsp;&emsp;&emsp;&emsp; https://pan.baidu.com/s/1Imd-lzXVgm3aCwnw28wT5A 提取码：b7hs （百度网盘） Mathtype7破解工具&emsp; 下载地址：https://www.lanzous.com/ia77bte（蓝奏云） &emsp;&emsp;&emsp;&emsp;&emsp;&emsp; https://www.jianguoyun.com/p/DVTSsAcQhO6ZCBim-PQC（坚果云） &emsp;&emsp;&emsp;&emsp;&emsp;&emsp; https://pan.baidu.com/s/1jgwNC6euGr5-fVC2ejmhZw 提取码：pyap （百度网盘） DiskGenius绿色中文破解版5.1.1&emsp; 下载地址：https://www.lanzous.com/ia77eib （蓝奏云） &emsp;&emsp;&emsp;&emsp;&emsp;&emsp; https://www.jianguoyun.com/p/DfVbz74Qnu6ZCBj_m_UC （坚果云） &emsp;&emsp;&emsp;&emsp;&emsp;&emsp; https://pan.baidu.com/s/1qIFp5NVh00rbAm8ycUShYA 提取码：bbnv （百度网盘） (adsbygoogle = window.adsbygoogle || []).push({}); 更多内容 敬请期待……","link":"/2050/01-01/download/"},{"title":"从影视业衍生出的对祖国发展的感想","text":"最近，《哪吒之魔童降世》刷爆了朋友圈。电影令人目一新的动画效果和故事情节堪称国漫的一大佳作。而此前，国产动漫电影已有了《大圣归来》《大鱼海棠》等诸多优秀作品。科幻方面，继“中国科幻元年”的《流浪地球》之后，又有了《上海堡垒》等电影。另外，《三体》动漫版也即将上线……传送门这些国产影视上的进步，足以突显出背后中国科技的发展。影视业的繁荣是计算机技术、3D技术、国民经济等多方面共同发展作用的结果。 而事实正是如此。近几年，中国在各方面取得了突飞猛进的发展：天眼、墨子号、北斗卫星导航系统、神威·太湖之光超级计算机、5G……中国的综合国力日益增强，已然走在了世界的前列。国人心底都油然而生一种自豪感。中华民族，经历了多少年的的沧桑蜕变，今天重又屹立在世界民族之林，一步一步实现伟大复兴的中国梦。身为龙的传人，我们都应担负起振兴中华、发展祖国的重任，为实现中国梦不懈奋斗。 (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-08/films-development/"},{"title":"画梅","text":"调色盘上的色彩分成两块，一边是梅枝的灰黑色，一边是梅花的浅黄色。浓淡、明暗相互映衬，不同色调的变幻中，有着一种独特的美感。一旁，随意地搁着几支大大小小的刷子。白色的画纸上，心中的图案渐渐浮现出轮廓。 是什么时候开始拾起画笔的？大概是小时候第一次看到曾曾祖父的画作时便有了这个念头。虬劲有力的墨色枝条上，点缀着数朵大红的腊梅。梅心里有着几点白雪，突显出花的艳丽。左上角题着 “待到山花烂漫时，她在丛中笑”。我痴痴地对着那幅画看了很久。不知是什么缘故，这副画似乎唤醒了我内心的什么东西，我就这样喜欢上了绘画。 父亲也会画些画，工作做完，有时便铺开画纸，随意画上几笔。同样是画梅花，只是不一样的风格。我曾问他为什么画画，为什么总爱画梅花。他答：“画画是为了反映内心。梅花是高洁、谦虚的，画梅其实就是体会、学习梅的精神的过程。”他抬头看着我，眼里似有不同于以往的神情。 我凝视着那幅画，捉摸着话中的意味。当初喜欢上画画，或许就是这个原因吧！从曾曾祖父开始，家里人就以画笔为接力棒，将这个精神接力了下去。 而现在，我眼前的白纸上正画着的，同样是梅花。花瓣淡黄，淡雅中透出一种坚韧。梅枝纤细，画面上大片的留白，简洁而不失韵味。“冰雪林中著此身，不同桃李混芳尘。” 画中的朵朵梅花，似娇弱，但却藏着一种谦虚、不屈不挠的精神，回想从前见到的祖辈和父亲的画，竟是那么的不同，又是那么的相似。细想来，祖父、父亲、我，一辈辈人的梅花图，虽然换了画法，换了颜料，但不变的是画中所表达的意蕴。一代一代人，一轮一轮的接力，这个精神就这样，以画的形式，流传在一个家族的血脉中。 古往今来，多少文人墨客用自己的见解，以各种各样的形式展现着梅花之于他们的意义，将这样的精神接力下来。而我们也是这接力中的一部分。点点寒梅在画笔下绽放，接力着那一分精神。 (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2020/01-20/huamei/"},{"title":"台风“利奇马”带来的感动","text":"超强台风“利奇马”过境，给沿海人民带来巨大损失的同时，也出现了一幕幕令人感动的画面。消防员🚒、警察👮、记者📰、外卖小哥🏍️……这些人在恶劣的天气中默默工作，保障着人们的安全和生活。 消防员🚒 每当意外发生，总有消防员尽力救援的身影。台风可以摧毁房屋，但不能摧毁消防员的斗志。自从台风登陆开始，消防员就以严阵以待。搜救失踪人员、疏散群众、制服洪涝……他们不顾疲惫，彻夜奋斗，努力将群众的损失降到最低。即使全身湿透、满身泥水、精疲力尽，累到倒地就睡着，也在所不惜。因为，救助群众在他们心中始终排在第一位，这是他们无上的光荣。 警察👮 民警、交警、武警在台风来临后同样第一时间出动，坚守在灾区一线，疏导群众、排查隐患、稳定情势，他们穿梭在城市的每一个角落，尽力维护城市各方面正常运作，为民众保驾护航。“俯首甘为孺子牛”，他们深入街头巷尾，帮助市民进行清理，台风无情人有情。 记者📰 台风来势汹汹，可记者依然坚守岗位，为沿海市民播送台风即时情况，指导群众避险，守在风雨第一线。风大到“根本站不住jio”，然而这些记者们热情饱满，做好新闻工作，认真而不失幽默。他们的新闻播报，让民众心中有了安慰，在风雨中传递着温情。 外卖小哥🏍️ 风雨中，街上的车辆稀疏了不少，但狂风挡不住、暴雨挡不住，狂风暴雨挡不住外卖小哥的脚步。风雨中，一个个红色、黄色、蓝色的身影闪过，与风雨赛跑、与时间赛跑，尽可能在最短的时间内把美食送到客户的手中。积水、湿滑的道路给他们带来多少困难，但他们无惧风雨。这样的人和事还有很多，官兵、市政人员、环卫工人、抢修员、各部门工作人员……是他们的尽心工作让受灾群众免除了烦恼。 为他们点赞！👍 (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-11/moving-moments-brought-by-typhoon-lekima/"},{"title":"Markdown 编辑器语法汇总","text":"Markdown是一种可以使用普通文本编辑器编写的标记语言，通过简单的标记语法，它可以使普通文本内容具有一定的格式。Markdown的语法简洁明了、学习容易，而且功能比纯文本更强，因此有很多人用它写博客。以下是Markdown常用语法汇总。 一、标题在标题前加#，如下 123456# 这是一级标题## 这是二级标题### 这是三级标题#### 这是四级标题##### 这是五级标题###### 这是六级标题 效果如下： 这是一级标题这是二级标题这是三级标题这是四级标题这是五级标题这是六级标题二、字体1. 加粗在要加粗内容前后加两个*，如下： **粗体** 效果： 粗体 2. 斜体在要加斜体内容前后加一个*，如下： *斜体* 效果： 斜体 3. 斜体加粗在要斜体加粗内容前后加三个*，如下： ***斜体加粗*** 效果： 斜体加粗 如果你的描述中需要用到 markdown 的符号，比如 “ _ # * “ 等，但又不想它被转义，这时候可以在这些符号前加反斜杠，如 \\_ \\# \\* 进行避免。 示例： 12\\_不想这里的文本变斜体\\_\\*\\*不想这里的文本被加粗\\*\\* 效果：_不想这里的文本变斜体_**不想这里的文本被加粗** 三、删除线要加删除线的文字前后加两个~号，如下： ~~这是加删除线的文字~~ 效果：这是加删除线的文字 四、引用在引用的文字前加&gt;和空格即可。引用可以嵌套，如加两个&gt;和空格及以上。如果引用中换行，可以用&lt;br&gt;进行换行，也可以换行后再加上&gt;和空格。列表、子列表、代码段的语法在引用中同样适用。如下： 1234567&gt; 这是引用的内容&gt; &gt; 这是引用的内容&gt; 这是引用的内容&lt;br&gt;这是引用的内容&gt; 这是引用的内容&gt; 这是引用的内容 效果如下： 这是引用的内容 这是引用的内容 这是引用的内容这是引用的内容 这是引用的内容这是引用的内容 五、分割线如果你有写分割线的习惯，可以新起一行输入三个或者三个以上的 - 或者 * 。当前后都有段落时，请空出一行。 示例： 1234-------******** 效果： (adsbygoogle = window.adsbygoogle || []).push({}); 六、超链接 常用方法 文字链接： [链接名称](http://链接网址) 网址链接： &lt;http://链接网址&gt; 效果：链接名称 &emsp;&emsp;&emsp;http://链接网址 注：Markdown本身语法不支持链接在新页面中打开，如果想要在新页面中打开的话可以用html语言的a标签代替。 1&lt;a href=&quot;超链接地址&quot; target=&quot;_blank&quot;&gt;超链接名&lt;/a&gt; 高级链接技巧 12345678910[Google][1] #（这个链接用 1 作为网址变量）[Yahoo!][yahoo] #（这个链接用 yahoo 作为网址变量）******文章内容****** #（然后在文档的结尾为变量赋值（网址）↓）[1]: https://www.google.com/ [yahoo]: https://www.yahoo.com/ 效果：Google &emsp;&emsp;&emsp;Yahoo! 七、图片跟链接的方法区别在于前面加了个感叹号!，这样是不是觉得好记多了呢？ 1![图片名称](http://图片网址) 当然，你也可以像网址那样对图片网址使用变量 八、代码如果你只想高亮语句中的某个函数名或关键字，可以在其前后加一个`符号实现。这个符号在电脑键盘 Tab 的上方。 你也可以用三个上述符号包裹一段代码，通常编辑器根据代码片段适配合适的高亮方法，但也可以在代码段前输入语言名称指定一种语言。 也可以使用 4 空格或Tab缩进，再贴上代码，实现相同的的效果 def g(x): yield from range(x, 0, -1) yield from range(x)如你不需要代码高亮，可以在代码段前输入nohighlight禁用。 九、列表1. 普通无序列表123- 列表文本前使用 [减号+空格]+ 列表文本前使用 [加号+空格]* 列表文本前使用 [星号+空格] 效果： 列表文本前使用 [减号+空格] 列表文本前使用 [加号+空格] 列表文本前使用 [星号+空格] 2. 普通有序列表1231. 列表前使用 [数字+空格]2. 会自动帮你添加数字7. 不用担心数字不对，显示的时候会自动把这行的 7 纠正为 3 效果： 列表前使用 [数字+空格] 会自动帮你添加数字 不用担心数字不对，显示的时候会自动把这行的 7 纠正为 3 3.列表嵌套12345671. 列出所有元素： - 无序列表元素 A 1. 元素 A 的有序子列表 - 前面加四个空格2. 列表里的多段换行： 前面必须加四个空格， 这样换行，整体的格式不会乱 效果： 列出所有元素： 无序列表元素 A 元素 A 的有序子列表 前面加四个空格 列表里的多段换行： 前面必须加四个空格， 这样换行，整体的格式不会乱 列表里可嵌套引用和代码段语法 十、表格1234|表头1|表头2|表头3|表头4||-|:-|:-:|-:||01|02|03|04||a|b|c|d| 说明：1.| - : 之间的多余空格会被忽略，不影响布局。 默认标题栏居中对齐，内容居左对齐。 第二行 || 间的符号控制对齐方式：- 为默认，:- 表示内容和标题栏居左对齐，:-: 表示内容和标题栏居中对齐，-: 表示内容和标题栏居右对齐。 每行第一个|和最后一个|可以省略，- 的数量至少有一个，多余的自动省略。 十一、换行如果另起一行，只需在当前行结尾加 2 个空格 在当前行的结尾加 2 个空格这行就会新起一行如果是要起一个新段落，只需要空出一行即可。 前方高能！ 高级技巧行内 HTML 元素目前只支持部分段内 HTML 元素效果，包括&lt;kdb&gt; &lt;b&gt; &lt;i&gt; &lt;em&gt; &lt;sup&gt; &lt;sub&gt; &lt;br&gt;，如 键位显示 使用 &lt;kbd&gt;Ctrl&lt;/kbd&gt;+&lt;kbd&gt;Alt&lt;/kbd&gt;+&lt;kbd&gt;Del&lt;/kbd&gt; 重启电脑 代码块 使用 &lt;pre&gt;&lt;/pre&gt; 元素同样可以形成代码块 粗斜体 &lt;b&gt;&lt;/b&gt; 在 Markdown 中同样适用 本站评论区支持Markdown语法，欢迎尝试。参考文章：Markdown 基本语法-高鸿祥-简书 Markdown 编辑器语法指南-思否Segmentfault Markdown 创建表格-橡皮24-简书 (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-17/Markdown/"},{"title":"中国“史上最严”垃圾分类施行，你准备好了吗？","text":"“你是哪种垃圾？”已成为2019最热门也是最费解的问题。 自上海开始实行垃圾🗑️分类，将垃圾分为♻️可回收物、☠️有害垃圾、🥬湿垃圾、🦴干垃圾后，国内掀起一阵学习垃圾分类的热潮。虽然南通还尚未实行垃圾分类的政策，但垃圾分类的宣传海报和垃圾桶早已到处都是。 上海此次的垃圾分类可谓中国史上最严，虽没有日本等国家分类得细，但也足以把上海人搞得焦头烂额。一杯珍珠奶茶要是喝不完，要先把奶茶bie干净，把珍珠倒到“湿垃圾”，把杯子倒到“干垃圾”，再把杯盖倒到“可回收”，垃圾放错地方还要罚款。种种严格政策之下，上海人纷纷努力简化日常垃圾，以至于买奶茶珍珠按个要，烤串不要竹签，蛤蜊不要壳……吃起饭来，积极践行“光盘行动”，否则饭后还得花上半个小时收拾垃圾😭。垃圾分类游戏、垃圾分类教学玩具、垃圾分类知识问答、垃圾分类……种种花样更是层出不穷。 (adsbygoogle = window.adsbygoogle || []).push({}); 这样的近乎“变态”的垃圾分类要求的意义何在？我认为，即使麻烦，也是很有必要的。仔细的垃圾分类，必能提高后期分类处理的效率，提高资源回收利用率。除此之外，垃圾分类还让人们养成了勤俭节约的习惯，可以有效地减少铺张浪费，减少垃圾产生。 但是，依我看来，目前的垃圾分类尚有待完善。干垃圾、湿垃圾这样的分法，官方给出的概念还较为笼统，当遇到一些特殊垃圾时，人们便难以分清。建议将垃圾分类要点做成手册进行发放，并将垃圾分类知识融入中小学教材，甚至把垃圾分类变成图形验证码等。多管齐下，通过各种方式，让垃圾分类知识烂熟于心。 另外，尚未推行垃圾分类的城市虽大多已开始宣传垃圾分类，但存在无人指导、无人配合、垃圾桶不全、宣传海报内容与我国当前分类要求不符等问题，缺乏实际效果。 相信我国的垃圾分类会越来越完善，也期待着全国推行垃圾分类的那一天的到来。 (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-14/something-about-recycling-waste/"},{"title":"《狮子王》观后感","text":"时隔首映25年，迪士尼《狮子王》🦁上映了3D真人版。抛开童话故事的纰漏不谈，这部电影蕴藏了许多值得深思的人生哲理。 电影从歌曲The Circle of Life开始，展现了一幅壮美的非洲草原之景。给人以震撼的同时，也暗含电影的主线——生命的轮回。 幼小无知的小狮子辛巴，不满父母的束缚，成天抱着对未来继承王位的日子的憧憬。但在企图谋权纂位的狮子刀疤的诱使下闯下大祸。事后，电影借狮王木法沙之口道出影片主旨之一：只在必要时候才勇敢，并且，勇敢并不意味着要去找麻烦。心中应常怀敬畏，盲目的勇敢只会招致祸患。 影片后半部分，辛巴在娜娜和老山魈🦍的劝导下，放弃了安逸的生活，回到了草原，担起了狮王的职责。而这里，又体现出影片的另一个更为重要的主题：生命是个轮回，在这样的循环中，每个人都应担自己的责任，守护这一份平衡。 这部影片虽是一个童话，但其实是借动物世界映射出人类社会。生活中，不如意事常八九，并不一切都如想象中那样美好。只有在一次次的考验中，不断学习，才能褪去年少无知，在社会中立足。 (adsbygoogle = window.adsbygoogle || []).push({});","link":"/2019/08-04/The-Lion-King/"}],"tags":[{"name":"🎞️电影","slug":"🎞️电影","link":"/tags/🎞️电影/"},{"name":"📜经典","slug":"📜经典","link":"/tags/📜经典/"},{"name":"🌐网络","slug":"🌐网络","link":"/tags/🌐网络/"},{"name":"💻计算机","slug":"💻计算机","link":"/tags/💻计算机/"},{"name":"</>编程","slug":"编程","link":"/tags/编程/"},{"name":"🇨🇳爱国","slug":"🇨🇳爱国","link":"/tags/🇨🇳爱国/"},{"name":"⚛️科技","slug":"⚛️科技","link":"/tags/⚛️科技/"},{"name":"🧨节日","slug":"🧨节日","link":"/tags/🧨节日/"},{"name":"1001软件","slug":"1001软件","link":"/tags/1001软件/"},{"name":"🥢🍽️美食","slug":"🥢🍽️美食","link":"/tags/🥢🍽️美食/"},{"name":"📓日记","slug":"📓日记","link":"/tags/📓日记/"},{"name":"🧑人物","slug":"🧑人物","link":"/tags/🧑人物/"},{"name":"♻️环保","slug":"♻️环保","link":"/tags/♻️环保/"}],"categories":[{"name":"🎞️观后感","slug":"🎞️观后感","link":"/categories/🎞️观后感/"},{"name":"📖读后感","slug":"📖读后感","link":"/categories/📖读后感/"},{"name":"📝教程","slug":"📝教程","link":"/categories/📝教程/"},{"name":"📃随笔","slug":"📃随笔","link":"/categories/📃随笔/"},{"name":"👍推荐","slug":"👍推荐","link":"/categories/👍推荐/"}]}